frontend/models/SignupForm.php

INSERT INTO `users` (`salt`, `password`, `email`, `time`) VALUES ('nLXv6Sinx6NR8oP', '$2y$13$Y.JG4X7743EFZxFNUsTu4.PHOBQOXT0IWorQnLRsO9pKKZa.maUk6', 'qwe@qwe.qwe', 1656702016)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();

        $user->setPassword($this->password);
        $user->email = $this->email;
        $user->setTime();
        $user->generateAuthKey();

        return $user->save();